Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.harbor.helm_release.harbor will be created
+ resource "helm_release" "harbor" {
      + atomic                     = false
      + chart                      = "harbor"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "harbor"
      + namespace                  = "harbor"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.goharbor.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                expose:
                  type: ingress
                  tls:
                    enabled: true
                    certSource: none
                  ingress:
                    hosts:
                      core: registry.goboolean.io
                    annotations:
                      kubernetes.io/ingress.class: istio
                externalURL: https://registry.goboolean.io
            EOT,
        ]
      + verify                     = false
      + version                    = "1.15.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.istio.kubernetes_manifest.istio_gateway will be created
+ resource "kubernetes_manifest" "istio_gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1alpha3"
          + kind       = "Gateway"
          + metadata   = {
              + name      = "istio-ingressgateway"
              + namespace = "istio-system"
            }
          + spec       = {
              + selector = {
                  + istio = "ingressgateway"
                }
              + servers  = [
                  + {
                      + hosts = [
                          + "*.goboolean.io",
                        ]
                      + port  = {
                          + name     = "https"
                          + number   = 443
                          + protocol = "HTTPS"
                        }
                      + tls   = {
                          + credentialName = "wildcard-goboolean-io-tls"
                          + mode           = "SIMPLE"
                        }
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1alpha3"
          + kind       = "Gateway"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "istio-ingressgateway"
              + namespace                  = "istio-system"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + selector = {
                  + istio = "ingressgateway"
                }
              + servers  = [
                  + {
                      + bind            = (known after apply)
                      + defaultEndpoint = (known after apply)
                      + hosts           = [
                          + "*.goboolean.io",
                        ]
                      + name            = (known after apply)
                      + port            = {
                          + name       = "https"
                          + number     = 443
                          + protocol   = "HTTPS"
                          + targetPort = (known after apply)
                        }
                      + tls             = {
                          + caCertificates        = (known after apply)
                          + caCrl                 = (known after apply)
                          + cipherSuites          = (known after apply)
                          + credentialName        = "wildcard-goboolean-io-tls"
                          + httpsRedirect         = (known after apply)
                          + maxProtocolVersion    = (known after apply)
                          + minProtocolVersion    = (known after apply)
                          + mode                  = "SIMPLE"
                          + privateKey            = (known after apply)
                          + serverCertificate     = (known after apply)
                          + subjectAltNames       = (known after apply)
                          + verifyCertificateHash = (known after apply)
                          + verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # module.namespace.kubernetes_namespace.harbor will be created
+ resource "kubernetes_namespace" "harbor" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "name" = "harbor"
            }
          + name             = "harbor"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
